src/DataProcessors/ОценкаРисков/ОценкаРисков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОценкаРисков</name>
</mdclass:DataProcessor>

src/InformationRegisters/Риски/Риски.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Риски</name>
  <resources>
    <name>ДатаВнесения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсточникФЭО</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСнабжение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаРиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаБыло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСтало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаДопустимая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПересмотрЦеныДопустимой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЦеныДопустимые/ЦеныДопустимые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныДопустимые</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыРиска/ТипыРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРиска</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/ОценкаРисков/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ПолучитьДанныеНаСервере();
	Если Не РольДоступна("Администратор") Тогда
	Элементы.ДобавитьМатериал.Доступность = РольДоступна("Снабжение");
	Элементы.ТаблицаМатериаловГруппа1.ТолькоПросмотр = Не РольДоступна("Снабжение");
	Элементы.ТаблицаМатериаловГруппа2.ТолькоПросмотр = Не РольДоступна("Снабжение");
	Элементы.ТаблицаМатериаловПричинаРиска.ТолькоПросмотр = Не РольДоступна("Снабжение");
	Элементы.ТаблицаМатериаловТаблицаКП.ТолькоПросмотр = Не РольДоступна("Снабжение");		
	Элементы.ТаблицаМатериаловКомментарий.ТолькоПросмотр = Не РольДоступна("ТехническийЛидер");
	Элементы.ТаблицаМатериаловТаблицаЗамен.ТолькоПросмотр = Не РольДоступна("ТехническийЛидер"); 
	Элементы.ТаблицаМатериаловЦенаДопустимая.ТолькоПросмотр = Не РольДоступна("ПолныйПросмотр");
		Если РольДоступна("Снабжение") или РольДоступна("ТехническийЛидер") Тогда
		Элементы.ТаблицаМатериаловТипРиска.ТолькоПросмотр = Ложь;		
		Иначе	
		Элементы.ТаблицаМатериаловТипРиска.ТолькоПросмотр = Истина;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
ТаблицаМатериалов.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Риски.Материал КАК Материал,
	|	Риски.ДатаВнесения КАК ДатаВнесения,
	|	Риски.ИсточникФЭО КАК ИсточникФЭО,
	|	Риски.ИсточникИзменение КАК ИсточникИзменение,
	|	Риски.ИсточникСнабжение КАК ИсточникСнабжение,
	|	Риски.ИсточникПроизводство КАК ИсточникПроизводство,
	|	Риски.ТипРиска КАК ТипРиска,
	|	Риски.ПричинаРиска КАК ПричинаРиска,
	|	Риски.ЦенаБыло КАК ЦенаБыло,
	|	Риски.ЦенаСтало КАК ЦенаСтало,
	|	Риски.ЦенаДопустимая КАК ЦенаДопустимая,
	|	Риски.ПересмотрЦеныДопустимой КАК ПересмотрЦеныДопустимой,
	|	Риски.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.Риски КАК Риски
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВнесения,
	|	Риски.Материал.Наименование";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ = ТаблицаМатериалов.Добавить(); 
	ТЧ.Материал = ВыборкаДетальныеЗаписи.Материал;
	ТЧ.Статус = ПолучитьСтатус(ВыборкаДетальныеЗаписи.Материал);
	ТЧ.ДатаВнесения = ВыборкаДетальныеЗаписи.ДатаВнесения;
	ТЧ.ИсточникФЭО = ВыборкаДетальныеЗаписи.ИсточникФЭО;
	ТЧ.ИсточникИзменение = ВыборкаДетальныеЗаписи.ИсточникИзменение;
	ТЧ.ИсточникСнабжение = ВыборкаДетальныеЗаписи.ИсточникСнабжение;
	ТЧ.ИсточникПроизводство = ВыборкаДетальныеЗаписи.ИсточникПроизводство;
	ТЧ.ТипРиска = ВыборкаДетальныеЗаписи.ТипРиска;
	ТЧ.ПричинаРиска = ВыборкаДетальныеЗаписи.ПричинаРиска;
	ТЧ.ЦенаБыло = ВыборкаДетальныеЗаписи.ЦенаБыло;
	ТЧ.ЦенаСтало = ВыборкаДетальныеЗаписи.ЦенаСтало;
	ТЧ.Отклонение = ?(ТЧ.ЦенаБыло > 0,(ТЧ.ЦенаСтало-ТЧ.ЦенаБыло)/ТЧ.ЦенаБыло*100,0);
	ТЧ.ЦенаДопустимая = ВыборкаДетальныеЗаписи.ЦенаДопустимая;
	ТЧ.ПересмотрЦеныДопустимой = ВыборкаДетальныеЗаписи.ПересмотрЦеныДопустимой;
	ТЧ.Комментарий = ВыборкаДетальныеЗаписи.Комментарий;  
		Для каждого ТЧ_М_З Из ВыборкаДетальныеЗаписи.Материал.Замены Цикл
		ТЧ_З = ТЧ.ТаблицаЗамен.Добавить();
		ТЧ_З.Материал = ТЧ_М_З.Материал;			
		ТЧ_З.Поставщики = ТЧ_М_З.Поставщики;
		ТЧ_З.Тип = ТипЗнч(ТЧ_М_З.Материал);		
		КонецЦикла;
			Для каждого ТЧ_КП Из ВыборкаДетальныеЗаписи.Материал.КоммерческиеПредложения Цикл 
        	ТЧ_ТКП = ТЧ.ТаблицаКП.Добавить();			
			ТЧ_ТКП.КП = ТЧ_КП.КП;	
			ТЧ_ТКП.Валюта = ТЧ_КП.Валюта;
			ТЧ_ТКП.ЦенаБыло = ТЧ_КП.ЦенаБыло;
			ТЧ_ТКП.ЦенаСтало = ТЧ_КП.ЦенаСтало;
			ТЧ_ТКП.Отклонение = ?(ТЧ_ТКП.ЦенаБыло > 0,(ТЧ_ТКП.ЦенаСтало-ТЧ_ТКП.ЦенаБыло)/ТЧ_ТКП.ЦенаБыло*100,0);
			ТЧ.КП = Истина;			
			КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПриИзменении(Элемент)
Элементы.ТаблицаМатериалов.ТекущиеДанные.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловТаблицаЗаменПриИзменении(Элемент)
Элементы.ТаблицаМатериалов.ТекущиеДанные.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловЦенаБылоПриИзменении(Элемент)
	Если Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло > 0 Тогда
	Элементы.ТаблицаМатериалов.ТекущиеДанные.Отклонение = (Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаСтало-Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло)/Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло*100;	
	КонецЕсли;
КонецПроцедуры
               
&НаКлиенте
Процедура ТаблицаМатериаловЦенаСталоПриИзменении(Элемент)
	Если Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло > 0 Тогда
	Элементы.ТаблицаМатериалов.ТекущиеДанные.Отклонение = (Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаСтало-Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло)/Элементы.ТаблицаМатериалов.ТекущиеДанные.ЦенаБыло*100;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьМатериалНаСервере(Материал)
ТЧ = ТаблицаМатериалов.Добавить();
ТЧ.Материал = Материал;
ТЧ.Статус = ПолучитьСтатус(Материал);
ТЧ.ДатаВнесения = ТекущаяДата();
ТЧ.Пометка = Истина;
ТЧ.Новый = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМатериал(Команда)
Материал = Неопределено;
	Если ВвестиЗначение(Материал,"Выберите материал",Тип("СправочникСсылка.Материалы")) Тогда 
	Выборка = ТаблицаМатериалов.НайтиСтроки(Новый Структура("Материал",Материал));
		Если Выборка.Количество() > 0 Тогда	
		Элементы.ТаблицаМатериалов.ТекущаяСтрока = ТаблицаМатериалов.Индекс(Выборка[0]);
		Иначе
		ДобавитьМатериалНаСервере(Материал);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПочтоваяРассылка(РР)
//Сообщение.Получатели.Добавить("a.gusarov@owen.ru");
//Сообщение.Получатели.Добавить("m.akimova@owen.ru");
//Сообщение.Получатели.Добавить("e.yanush@owen.ru");
//Сообщение.Тема = "Оценка рисков. Новый материал. (автоматическая рассылка)!"; 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Добавлен новый материал:";
Текст = Текст + Символы.ПС+ СокрЛП(РР.Материал.Наименование);	
Текст = Текст + Символы.ПС+ "";
	Если РР.ТипРиска = Перечисления.ТипыРиска.Высокий Тогда 
	//Сообщение.Получатели.Добавить("k.valyunin@owen.ru");
	//Сообщение.Получатели.Добавить("z.chernova@owen.ru");
	//Сообщение.Получатели.Добавить("e.aladysheva@owen.ru");
	//Сообщение.Получатели.Добавить("tech@owen.ru");
	//Сообщение.Получатели.Добавить("a.posokhov@owen.ru");
	//Сообщение.Получатели.Добавить("v.timoshkov@owen.ru");
	//Сообщение.Получатели.Добавить("e.bagaev@owen.ru");
	//Сообщение.Получатели.Добавить("a.nikolaev@owen.ru");
	Код = 2;			
	Текст = Текст + Символы.ПС+ "Материалу присвоен тип риска: Высокий";
	Текст = Текст + Символы.ПС+ "";
	Иначе
	Код = 1;
	КонецЕсли;
Текст = Текст + Символы.ПС+ "Служба автоматической рассылки производственной базы!";
Ошибки = ОбщийМодульВызовСервера.ОтправитьПочтовуюРассылку(РеквизитФормыВЗначение("Объект"),Код,Текст);
	Если Ошибки <> Неопределено Тогда
	Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПочтоваяРассылкаВысокийРиск(РР)
//Сообщение.Получатели.Добавить("k.valyunin@owen.ru");
//Сообщение.Получатели.Добавить("m.akimova@owen.ru");
//Сообщение.Получатели.Добавить("e.yanush@owen.ru");
//Сообщение.Получатели.Добавить("z.chernova@owen.ru");
//Сообщение.Получатели.Добавить("e.aladysheva@owen.ru");
//Сообщение.Получатели.Добавить("tech@owen.ru");
//Сообщение.Получатели.Добавить("a.posokhov@owen.ru");
//Сообщение.Получатели.Добавить("v.timoshkov@owen.ru");
//Сообщение.Получатели.Добавить("e.bagaev@owen.ru");
//Сообщение.Получатели.Добавить("a.nikolaev@owen.ru");
//Сообщение.Тема = "Оценка рисков. Высокий риск. (автоматическая рассылка)!"; 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Материалу присвоен тип риска: Высокий";
Текст = Текст + Символы.ПС+ СокрЛП(РР.Материал.Наименование);	
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Служба автоматической рассылки производственной базы!";
Ошибки = ОбщийМодульВызовСервера.ОтправитьПочтовуюРассылку(РеквизитФормыВЗначение("Объект"),3,Текст);
	Если Ошибки <> Неопределено Тогда
	Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПочтоваяРассылкаЦенаДопустимая(РЦД,СтараяЦена)
//Сообщение.Получатели.Добавить("m.akimova@owen.ru");
//Сообщение.Получатели.Добавить("e.yanush@owen.ru");
//Сообщение.Тема = "Оценка рисков. Изменение допустимой цены. (автоматическая рассылка)!"; 
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Изменилась допустимая цена материала с "+Строка(СтараяЦена)+" на "+Строка(РЦД.Цена);
Текст = Текст + Символы.ПС+ СокрЛП(РЦД.МПЗ.Наименование);	
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Служба автоматической рассылки производственной базы!";
Ошибки = ОбщийМодульВызовСервера.ОтправитьПочтовуюРассылку(РеквизитФормыВЗначение("Объект"),4,Текст);
	Если Ошибки <> Неопределено Тогда
	Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПочтоваяРассылкаКП(РР)
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Материалу " + СокрЛП(РР.Материал.Наименование) + " добавлено новое коммерческое предложение.";	
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Служба автоматической рассылки производственной базы!";
Ошибки = ОбщийМодульВызовСервера.ОтправитьПочтовуюРассылку(РеквизитФормыВЗначение("Объект"),5,Текст);
	Если Ошибки <> Неопределено Тогда
	Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПочтоваяРассылкаПересмотрДЦ(РР)
Текст = "Здравствуйте!";
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Материалу " + СокрЛП(РР.Материал.Наименование) + " требуется пересмотреть допустимую цену.";
Текст = Текст + Символы.ПС+ "Текущая допустимая цена "+РР.ЦенаДопустимая+" USD.";	
Текст = Текст + Символы.ПС+ "";
Текст = Текст + Символы.ПС+ "Служба автоматической рассылки производственной базы!";
Ошибки = ОбщийМодульВызовСервера.ОтправитьПочтовуюРассылку(РеквизитФормыВЗначение("Объект"),6,Текст);
	Если Ошибки <> Неопределено Тогда
	Сообщить(Ошибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВнестиИзмененияНаСервере()
	Для каждого ТЧ Из ТаблицаМатериалов Цикл 
		Если ТЧ.Пометка Тогда
			Попытка
			НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1; 
			РР_Тек = РегистрыСведений.Риски.Получить(Новый Структура("Материал",ТЧ.Материал));
				Если Не ЗначениеЗаполнено(РР_Тек.ДатаВнесения) Тогда 
				РР = РегистрыСведений.Риски.СоздатьМенеджерЗаписи();
				РР.Материал = ТЧ.Материал;
				РР.ДатаВнесения = ТекущаяДата();
				РР.ИсточникФЭО = ТЧ.ИсточникФЭО;
				РР.ИсточникИзменение = ТЧ.ИсточникИзменение;
				РР.ИсточникСнабжение = ТЧ.ИсточникСнабжение;
				РР.ИсточникПроизводство = ТЧ.ИсточникПроизводство;
				РР.ТипРиска = ТЧ.ТипРиска;
				РР.ПричинаРиска = ТЧ.ПричинаРиска;
				РР.ЦенаБыло = ТЧ.ЦенаБыло;
				РР.ЦенаСтало = ТЧ.ЦенаСтало;
				РР.ЦенаДопустимая = ТЧ.ЦенаДопустимая;
				РР.ПересмотрЦеныДопустимой = ТЧ.ПересмотрЦеныДопустимой;
				РР.Комментарий = ТЧ.Комментарий;
				РР.Записать();
				ПочтоваяРассылка(РР);	
				Иначе
				ТипРискаСтарый = РР_Тек.ТипРиска;
				РР = РегистрыСведений.Риски.СоздатьМенеджерЗаписи();
				РР.Материал = ТЧ.Материал;
				РР.ДатаВнесения = РР_Тек.ДатаВнесения;
				РР.ИсточникФЭО = ТЧ.ИсточникФЭО;
				РР.ИсточникИзменение = ТЧ.ИсточникИзменение;
				РР.ИсточникСнабжение = ТЧ.ИсточникСнабжение;
				РР.ИсточникПроизводство = ТЧ.ИсточникПроизводство;
				РР.ТипРиска = ТЧ.ТипРиска;
				РР.ПричинаРиска = ТЧ.ПричинаРиска;
				РР.ЦенаБыло = ТЧ.ЦенаБыло;
				РР.ЦенаСтало = ТЧ.ЦенаСтало;
				РР.ЦенаДопустимая = ТЧ.ЦенаДопустимая;
				РР.ПересмотрЦеныДопустимой = ТЧ.ПересмотрЦеныДопустимой;
				РР.Комментарий = ТЧ.Комментарий;
				РР.Записать();
					Если ТЧ.ТипРиска = Перечисления.ТипыРиска.Высокий Тогда
						Если ТипРискаСтарый <> ТЧ.ТипРиска Тогда
						ПочтоваяРассылкаВысокийРиск(РР);	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
					Если ЗначениеЗаполнено(ТЧ.ЦенаДопустимая) Тогда
					РЦД_Тек = РегистрыСведений.ЦеныДопустимые.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",ТЧ.Материал));
						Если РЦД_Тек.Цена <> ТЧ.ЦенаДопустимая Тогда
						РЦД = РегистрыСведений.ЦеныДопустимые.СоздатьМенеджерЗаписи(); 
						РЦД.Период = ТекущаяДата();
						РЦД.МПЗ = ТЧ.Материал;     
						РЦД.Сотрудник = ПараметрыСеанса.Пользователь;
						РЦД.Цена = ТЧ.ЦенаДопустимая;
				        РЦД.Записать(Истина);
						ПочтоваяРассылкаЦенаДопустимая(РЦД,РЦД_Тек.Цена);
						КонецЕсли;
					КонецЕсли;
			Материал_Объект = ТЧ.Материал.ПолучитьОбъект();
			Материал_Объект.ТипРиска = ТЧ.ТипРиска;
			Материал_Объект.Замены.Очистить();
				Для каждого ТЧ_З Из ТЧ.ТаблицаЗамен Цикл
					Если ТипЗнч(ТЧ_З.Материал) <> Тип("Неопределено") Тогда
					ТЧ_М_З = Материал_Объект.Замены.Добавить();
					ТЧ_М_З.Материал = ТЧ_З.Материал;
					ТЧ_М_З.Поставщики = ТЧ_З.Поставщики;
					КонецЕсли;	
				КонецЦикла;                                
			флИзменениеКП = Ложь;
					Для каждого ТЧ_ТКП Из ТЧ.ТаблицаКП Цикл 
					Выборка = Материал_Объект.КоммерческиеПредложения.НайтиСтроки(Новый Структура("КП",СокрЛП(ТЧ_ТКП.КП)));
						Если Выборка.Количество() = 0 Тогда
						флИзменениеКП = Истина;
						КонецЕсли;	
					КонецЦикла;
			Материал_Объект.КоммерческиеПредложения.Очистить();
				Для каждого ТЧ_ТКП Из ТЧ.ТаблицаКП Цикл
				ТЧ_КП = Материал_Объект.КоммерческиеПредложения.Добавить();
				ТЧ_КП.КП = ТЧ_ТКП.КП;
				ТЧ_КП.Валюта = ТЧ_ТКП.Валюта;
				ТЧ_КП.ЦенаБыло = ТЧ_ТКП.ЦенаБыло;
				ТЧ_КП.ЦенаСтало = ТЧ_ТКП.ЦенаСтало;
				ТЧ.КП = Истина;	
				КонецЦикла;
			Материал_Объект.Записать();	
				Если флИзменениеКП Тогда
				ПочтоваяРассылкаКП(РР);
				КонецЕсли;
					Если ТЧ.ПересмотрЦеныДопустимой Тогда
					ПочтоваяРассылкаПересмотрДЦ(РР);
					КонецЕсли;
			ТЧ.Пометка = Ложь;
			ТЧ.Новый = Ложь;				
			ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;		
			Исключение
			Сообщить(ОписаниеОшибки());
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);		
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВнестиИзменения(Команда)
ВнестиИзмененияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПередУдалением(Элемент, Отказ)
	Если Не Элементы.ТаблицаМатериалов.ТекущиеДанные.Новый Тогда
	Сообщить("Можно удалять только вновь введённые материалы!");
	Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловТаблицаЗаменМатериалПриИзменении(Элемент)
Элементы.ТаблицаМатериаловТаблицаЗамен.ТекущиеДанные.Тип = ТипЗнч(Элементы.ТаблицаМатериаловТаблицаЗамен.ТекущиеДанные.Материал);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловТаблицаКППриИзменении(Элемент)
Элементы.ТаблицаМатериалов.ТекущиеДанные.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловТаблицаКПЦенаБылоПриИзменении(Элемент)
	Если Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло > 0 Тогда
	Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.Отклонение = (Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаСтало-Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло)/Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло*100;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловТаблицаКПЦенаСталоПриИзменении(Элемент)
	Если Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло > 0 Тогда
	Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.Отклонение = (Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаСтало-Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло)/Элементы.ТаблицаМатериаловТаблицаКП.ТекущиеДанные.ЦенаБыло*100;	
	КонецЕсли;
КонецПроцедуры
